In [122]:
x = "Manogya Harsha Bajracharya"
print(x)

Manogya Harsha Bajracharya

## Title

In [123]:
countries = ["USA","NEPAL","CHINA","BRAZIL"]
print(countries)

['USA', 'NEPAL', 'CHINA', 'BRAZIL']

In [124]:
countries[1]

'NEPAL'

In [125]:
countries

['USA', 'NEPAL', 'CHINA', 'BRAZIL']

In [126]:
countries.append("Malaysia")

In [127]:
countries

['USA', 'NEPAL', 'CHINA', 'BRAZIL', 'Malaysia']

In [128]:
countries.insert(0,"Spain")

In [129]:
countries

['Spain', 'USA', 'NEPAL', 'CHINA', 'BRAZIL', 'Malaysia']

In [130]:
countries_2 = ["UK","Germany","Austria"]

In [131]:
countries + countries_2

['Spain',
 'USA',
 'NEPAL',
 'CHINA',
 'BRAZIL',
 'Malaysia',
 'UK',
 'Germany',
 'Austria']

In [132]:
numbers = [4,3,10,7,1,2]
numbers.sort()

In [133]:
numbers.sort(reverse=True)

In [134]:
print(numbers)

[10, 7, 4, 3, 2, 1]

In [135]:
numbers[0] = 100

In [136]:
print(numbers)

[100, 7, 4, 3, 2, 1]

In [137]:
countries[:]

['Spain', 'USA', 'NEPAL', 'CHINA', 'BRAZIL', 'Malaysia']

In [138]:
new_list = countries.copy()

In [139]:
new_list

['Spain', 'USA', 'NEPAL', 'CHINA', 'BRAZIL', 'Malaysia']

In [140]:
my_data= {"Names": {"Manogya","Harsha","Bajracharya"},
          "Age": {12,13,14}}
print(my_data)

{'Names': {'Bajracharya', 'Manogya', 'Harsha'}, 'Age': {12, 13, 14}}

In [141]:
my_data = {
    "Names": ["Manogya", "Harsha", "Bajracharya"],
    "Age": [12, 13, 14]
}
print(my_data)

{'Names': ['Manogya', 'Harsha', 'Bajracharya'], 'Age': [12, 13, 14]}

In [142]:
my_data.keys()

dict_keys(['Names', 'Age'])

In [143]:
my_data.values()

dict_values([['Manogya', 'Harsha', 'Bajracharya'], [12, 13, 14]])

In [144]:
my_data['height'] = 1.7

In [145]:
my_data

{'Names': ['Manogya', 'Harsha', 'Bajracharya'],
 'Age': [12, 13, 14],
 'height': 1.7}

In [146]:
new = {"Name" : "Manogya",
       "Age" : "20"}

In [147]:
new

{'Name': 'Manogya', 'Age': '20'}

In [148]:
new1 = new.copy()
print(new1)

{'Name': 'Manogya', 'Age': '20'}

In [149]:
new2 = new
print(new)

{'Name': 'Manogya', 'Age': '20'}

In [150]:
new

{'Name': 'Manogya', 'Age': '20'}

In [151]:
new.pop('Name')

'Manogya'

In [152]:
new

{'Age': '20'}

In [153]:
new1 = {"Name" : "Manogya",
       "Age" : "20"}

In [154]:
del new1['Age']

In [155]:
new1

{'Name': 'Manogya'}

In [156]:
new1.clear()
new1

{}

In [157]:
age = 13
if age >= 18 :
    print("you are adult")
elif age == 13:
    print("fuck u")
else:
    print("you a kid")

fuck u

In [158]:
a = 10
for x in range(a):
    print(x)

0
1
2
3
4
5
6
7
8
9

In [159]:
countries = ["USA","India","China","Brazil"]

In [160]:
for i, country in enumerate(countries):
    print(i)
    print(country)

0
USA
1
India
2
China
3
Brazil

In [161]:
for  country in countries:
    print(country)

USA
India
China
Brazil

In [162]:
a = {"Name" : "Manogya",
       "Age" : "20"}

In [163]:
a.items()

dict_items([('Name', 'Manogya'), ('Age', '20')])

In [164]:
def function(a,b):
    sum = a + b
    return print("sum is",sum)
function(1,2)

sum is 3

In [165]:
for i in range(1,10,2):
    print(i)

1
3
5
7
9

In [166]:
import os

In [167]:
os.getcwd()

'C:\\Users\\ASUS\\Desktop\\College Works\\DataScience'

In [168]:
os.listdir()

['.ipynb_checkpoints',
 'm4nogya.ipynb',
 'New Folder',
 'StudentsPerformance.csv']

In [169]:
import numpy as np
import pandas as pd

In [170]:
a= np.array([[1,2],[2,1],[3,1]])

In [171]:
df = pd.DataFrame(a, index=['row1','row2','row3'],
            columns = ['col1','col2'])

In [172]:
df

      col1  col2
row1     1     2
row2     2     1
row3     3     1

In [173]:
a= [[1,2],[2,1],[3,1]]

In [174]:
df = pd.DataFrame(a, index=['row1','row2','row3'],
            columns = ['col1','col2'])

In [175]:
df

      col1  col2
row1     1     2
row2     2     1
row3     3     1

In [176]:
states = ['Kathmandu','Lalitpur','Bhaktapur','Pokhara']
population = [1,2,3,4]

In [177]:
dict_states = {'States':states,'Population':population}

In [178]:
print(dict_states)

{'States': ['Kathmandu', 'Lalitpur', 'Bhaktapur', 'Pokhara'], 'Population': [1, 2, 3, 4]}

In [179]:
df = pd.DataFrame(dict_states)

In [180]:
df

      States  Population
0  Kathmandu           1
1   Lalitpur           2
2  Bhaktapur           3
3    Pokhara           4

In [181]:
df_exams = pd.read_csv('StudentsPerformance.csv')

In [182]:
df_exams.tail()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [183]:
df_exams.shape

(1000, 8)

In [184]:
df_exams.index

RangeIndex(start=0, stop=1000, step=1)

In [185]:
df_exams.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [186]:
df_exams.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [187]:
df_exams.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [188]:
len(df_exams)

1000

In [189]:
max(df_exams)

'writing score'

In [190]:
min(df_exams.index)

0

In [191]:
type(df_exams)

pandas.core.frame.DataFrame

In [192]:
round(df_exams,2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [193]:
df_exams.shape

(1000, 8)

In [194]:
df_exams.shape

(1000, 8)

In [195]:
df_exams.index

RangeIndex(start=0, stop=1000, step=1)

In [196]:
df_exams.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [197]:
df_exams.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [198]:
df_exams.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [199]:
round(df_exams,2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [200]:
df_exams['gender']

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [201]:
type(df_exams['gender'])

pandas.core.series.Series

In [202]:
df_exams['gender'].index

RangeIndex(start=0, stop=1000, step=1)

In [203]:
df_exams['gender'].head()

0    female
1    female
2    female
3      male
4      male
Name: gender, dtype: object

In [204]:
df_exams.gender

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [205]:
df_exams['math score']

0      72
1      69
2      90
3      47
4      76
       ..
995    88
996    62
997    59
998    68
999    77
Name: math score, Length: 1000, dtype: int64

##select 2 columns

In [206]:
df_exams[['math score','gender']]

     math score  gender
0            72  female
1            69  female
2            90  female
3            47    male
4            76    male
..          ...     ...
995          88  female
996          62    male
997          59  female
998          68  female
999          77  female

[1000 rows x 2 columns]

In [207]:
type(df_exams[['math score','gender']])

pandas.core.frame.DataFrame

In [208]:
df_exams[['math score','gender','reading score','writing score']]

     math score  gender  reading score  writing score
0            72  female             72             74
1            69  female             90             88
2            90  female             95             93
3            47    male             57             44
4            76    male             78             75
..          ...     ...            ...            ...
995          88  female             99             95
996          62    male             55             55
997          59  female             71             65
998          68  female             78             77
999          77  female             86             86

[1000 rows x 4 columns]

In [209]:
df_exams['language score'] =  70

In [210]:
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score
0,female,group B,bachelor's degree,standard,none,72,72,74,70
1,female,group C,some college,standard,completed,69,90,88,70
2,female,group B,master's degree,standard,none,90,95,93,70
3,male,group A,associate's degree,free/reduced,none,47,57,44,70
4,male,group C,some college,standard,none,76,78,75,70
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,70
996,male,group C,high school,free/reduced,none,62,55,55,70
997,female,group C,high school,free/reduced,completed,59,71,65,70
998,female,group D,some college,standard,completed,68,78,77,70
999,female,group D,some college,free/reduced,none,77,86,86,70

In [211]:
import numpy as np

In [212]:
language_score = (np.arange(0,1000))

In [213]:
len(language_score)

1000

In [214]:
df_exams['language score'] = language_score
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score
0,female,group B,bachelor's degree,standard,none,72,72,74,0
1,female,group C,some college,standard,completed,69,90,88,1
2,female,group B,master's degree,standard,none,90,95,93,2
3,male,group A,associate's degree,free/reduced,none,47,57,44,3
4,male,group C,some college,standard,none,76,78,75,4
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,995
996,male,group C,high school,free/reduced,none,62,55,55,996
997,female,group C,high school,free/reduced,completed,59,71,65,997
998,female,group D,some college,standard,completed,68,78,77,998
999,female,group D,some college,free/reduced,none,77,86,86,999

In [215]:
int_language_score = np.random.randint(1,100,size = 1000)

In [216]:
min(int_language_score)

np.int32(1)

In [217]:
df_exams['language score'] = int_language_score
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score
0,female,group B,bachelor's degree,standard,none,72,72,74,49
1,female,group C,some college,standard,completed,69,90,88,18
2,female,group B,master's degree,standard,none,90,95,93,22
3,male,group A,associate's degree,free/reduced,none,47,57,44,26
4,male,group C,some college,standard,none,76,78,75,27
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,46
996,male,group C,high school,free/reduced,none,62,55,55,71
997,female,group C,high school,free/reduced,completed,59,71,65,86
998,female,group D,some college,standard,completed,68,78,77,17
999,female,group D,some college,free/reduced,none,77,86,86,22

In [218]:
np.random.uniform(1,100, size =100)

array([36.25181153, 50.73572853, 58.24592593, 84.90391449, 45.64581153,
       24.78719709, 67.39089939, 46.27050072, 56.00049939, 52.45275925,
       77.47404206, 36.46916747, 79.78969289, 21.21051709, 85.86148199,
       94.00618383, 91.47810951, 51.94596921, 99.47555496, 63.63771434,
       16.53476097, 21.50083544,  3.79051503, 84.87837812, 65.43249984,
       12.06575198, 56.48665529, 42.38471004, 82.0158025 , 76.76135649,
        6.82799172, 40.08670868, 80.9903536 , 89.87230957, 77.14416029,
       95.16809344, 70.22102504, 40.41211084, 37.02616879, 70.90233323,
       60.65984492, 21.57020486, 35.07787582,  9.86263926, 95.21990023,
       88.61351187, 43.74590069, 89.32717555, 50.03876263, 89.03207103,
       65.57968295, 62.2129114 , 11.97655435,  3.8678796 , 43.02973699,
        9.06222569, 11.072905  , 77.45789303, 89.52568572,  9.63650383,
       69.45771124, 71.99095381, 63.65386533, 36.34848192, 97.8372818 ,
       44.92206738, 74.30010081, 60.13314362, 16.27244442, 58.45107312,
       10.3906086 , 13.50131669, 98.23755867, 29.08284586,  6.12063432,
       18.50571791, 41.3676181 , 89.92457033, 37.4309699 , 35.06898498,
       37.60795909, 13.73595232, 53.74769301, 63.12484366, 12.50475885,
       98.86087702, 89.11793305,  4.49945807, 45.55194975, 80.5263422 ,
       93.97042248, 32.10374689, 59.98608367, 88.61248759, 53.58347904,
       31.17193196, 66.59714635, 94.22520933, 28.03694681, 61.22099613])

In [219]:
score1 = np.random.randint(1,100,size = 1000)
score2 = np.random.randint(1,100,size = 1000)

In [220]:
series1 = pd.Series(score1, index=np.arange(0, 1000))
series2 = pd.Series(score2, index=np.arange(0, 1000))

In [221]:
series1

0      16
1      29
2      71
3      77
4      28
       ..
995    47
996    91
997    68
998    65
999    32
Length: 1000, dtype: int32

In [222]:
df_exams = df_exams.assign(score1=series1, score2=series2)

In [223]:
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score,score1,score2
0,female,group B,bachelor's degree,standard,none,72,72,74,49,16,77
1,female,group C,some college,standard,completed,69,90,88,18,29,73
2,female,group B,master's degree,standard,none,90,95,93,22,71,20
3,male,group A,associate's degree,free/reduced,none,47,57,44,26,77,44
4,male,group C,some college,standard,none,76,78,75,27,28,22
...,...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,46,47,96
996,male,group C,high school,free/reduced,none,62,55,55,71,91,66
997,female,group C,high school,free/reduced,completed,59,71,65,86,68,72
998,female,group D,some college,standard,completed,68,78,77,17,65,97
999,female,group D,some college,free/reduced,none,77,86,86,22,32,68

In [224]:
df_exams.insert(1,'test',series1)

In [225]:
df_exams

,gender,test,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score,score1,score2
0,female,16,group B,bachelor's degree,standard,none,72,72,74,49,16,77
1,female,29,group C,some college,standard,completed,69,90,88,18,29,73
2,female,71,group B,master's degree,standard,none,90,95,93,22,71,20
3,male,77,group A,associate's degree,free/reduced,none,47,57,44,26,77,44
4,male,28,group C,some college,standard,none,76,78,75,27,28,22
...,...,...,...,...,...,...,...,...,...,...,...,...
995,female,47,group E,master's degree,standard,completed,88,99,95,46,47,96
996,male,91,group C,high school,free/reduced,none,62,55,55,71,91,66
997,female,68,group C,high school,free/reduced,completed,59,71,65,86,68,72
998,female,65,group D,some college,standard,completed,68,78,77,17,65,97
999,female,32,group D,some college,free/reduced,none,77,86,86,22,32,68

In [226]:
df_exams['math score'].sum()

np.int64(66089)

In [227]:
df_exams['math score'].count()

np.int64(1000)

In [228]:
df_exams['math score'].mean()

np.float64(66.089)

In [229]:
df_exams['math score'].describe()

count    1000.00000
mean       66.08900
std        15.16308
min         0.00000
25%        57.00000
50%        66.00000
75%        77.00000
max       100.00000
Name: math score, dtype: float64

In [230]:
df_exams.describe()

,test,math score,reading score,writing score,language score,score1,score2
count,1000.00000,1000.00000,1000.000000,1000.000000,1000.000000,1000.00000,1000.000000
mean,50.09900,66.08900,69.169000,68.054000,49.465000,50.09900,51.360000
std,28.49841,15.16308,14.600192,15.195657,28.649844,28.49841,28.026735
min,1.00000,0.00000,17.000000,10.000000,1.000000,1.00000,1.000000
25%,25.00000,57.00000,59.000000,57.750000,25.000000,25.00000,27.000000
50%,51.00000,66.00000,70.000000,69.000000,49.000000,51.00000,53.000000
75%,75.00000,77.00000,79.000000,79.000000,75.000000,75.00000,74.000000
max,99.00000,100.00000,100.000000,100.000000,99.000000,99.00000,99.000000

In [231]:
df_exams['math score']+	df_exams['reading score']+df_exams['writing score']

0      218
1      247
2      278
3      148
4      229
      ...
995    282
996    172
997    195
998    223
999    249
Length: 1000, dtype: int64

In [232]:
df_exams['Average'] = df_exams['math score']+	df_exams['reading score']+df_exams['writing score']/ 3

In [233]:
df_exams.round(2)

,gender,test,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score,score1,score2,Average
0,female,16,group B,bachelor's degree,standard,none,72,72,74,49,16,77,168.67
1,female,29,group C,some college,standard,completed,69,90,88,18,29,73,188.33
2,female,71,group B,master's degree,standard,none,90,95,93,22,71,20,216.00
3,male,77,group A,associate's degree,free/reduced,none,47,57,44,26,77,44,118.67
4,male,28,group C,some college,standard,none,76,78,75,27,28,22,179.00
...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,female,47,group E,master's degree,standard,completed,88,99,95,46,47,96,218.67
996,male,91,group C,high school,free/reduced,none,62,55,55,71,91,66,135.33
997,female,68,group C,high school,free/reduced,completed,59,71,65,86,68,72,151.67
998,female,65,group D,some college,standard,completed,68,78,77,17,65,97,171.67
999,female,32,group D,some college,free/reduced,none,77,86,86,22,32,68,191.67

In [234]:
len(df_exams['gender'])

1000

In [235]:
df_exams['gender'].count()

np.int64(1000)

In [236]:
df_exams['gender'].value_counts()

gender
female    518
male      482
Name: count, dtype: int64

In [237]:
df_exams['gender'].value_counts(normalize =True)

gender
female    0.518
male      0.482
Name: proportion, dtype: float64

In [238]:
df_exams['parental level of education'].value_counts()

parental level of education
some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: count, dtype: int64

In [239]:
df_exams['parental level of education'].value_counts(normalize = True).round(2)

parental level of education
some college          0.23
associate's degree    0.22
high school           0.20
some high school      0.18
bachelor's degree     0.12
master's degree       0.06
Name: proportion, dtype: float64

In [240]:
df_exams.sort_values(by= 'math score',ascending=False,inplace =True)

In [241]:
df_exams

,gender,test,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score,score1,score2,Average
962,female,69,group E,associate's degree,standard,none,100,100,100,50,69,6,233.333333
458,female,9,group E,bachelor's degree,standard,none,100,100,100,21,9,73,233.333333
149,male,12,group E,associate's degree,free/reduced,completed,100,100,93,39,12,80,231.000000
625,male,2,group D,some college,standard,completed,100,97,99,96,2,21,230.000000
916,male,7,group E,bachelor's degree,standard,completed,100,100,100,63,7,16,233.333333
...,...,...,...,...,...,...,...,...,...,...,...,...,...
145,female,67,group C,some college,free/reduced,none,22,39,33,55,67,53,72.000000
787,female,38,group B,some college,standard,none,19,38,32,87,38,82,67.666667
17,female,30,group B,some high school,free/reduced,none,18,32,28,65,30,44,59.333333
980,female,13,group B,high school,free/reduced,none,8,24,23,73,13,36,39.666667
59,female,87,group C,some high school,free/reduced,none,0,17,10,28,87,66,20.333333

In [ ]:
random.shuffle(new_index)

In [ ]:
new_index

In [ ]:
df_exams['new_index'] = new_index

In [ ]:
df_exams

In [ ]:
df_exams.set_index('new_index',inplace = True)

In [ ]:
df_exams

In [247]:
df_exams.sort_index(inplace = True)
df_exams

,Gender,test,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score,score1,score2,Average
0,female,16,group B,bachelor's degree,standard,none,72,72,74,49,16,77,168.666667
1,female,29,group C,some college,standard,completed,69,90,88,18,29,73,188.333333
2,female,71,group B,master's degree,standard,none,90,95,93,22,71,20,216.000000
3,male,77,group A,associate's degree,free/reduced,none,47,57,44,26,77,44,118.666667
4,male,28,group C,some college,standard,none,76,78,75,27,28,22,179.000000
...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,female,47,group E,master's degree,standard,completed,88,99,95,46,47,96,218.666667
996,male,91,group C,high school,free/reduced,none,62,55,55,71,91,66,135.333333
997,female,68,group C,high school,free/reduced,completed,59,71,65,86,68,72,151.666667
998,female,65,group D,some college,standard,completed,68,78,77,17,65,97,171.666667
999,female,32,group D,some college,free/reduced,none,77,86,86,22,32,68,191.666667

In [248]:
df_exams = df_exams.rename(columns={'gender':'Gender'})

In [249]:
df_exams.rename(columns={'math score':'MS',
                        'reading score':'RS',
                        'writing score':'WS'})

,Gender,test,race/ethnicity,parental level of education,lunch,test preparation course,MS,RS,WS,language score,score1,score2,Average
0,female,16,group B,bachelor's degree,standard,none,72,72,74,49,16,77,168.666667
1,female,29,group C,some college,standard,completed,69,90,88,18,29,73,188.333333
2,female,71,group B,master's degree,standard,none,90,95,93,22,71,20,216.000000
3,male,77,group A,associate's degree,free/reduced,none,47,57,44,26,77,44,118.666667
4,male,28,group C,some college,standard,none,76,78,75,27,28,22,179.000000
...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,female,47,group E,master's degree,standard,completed,88,99,95,46,47,96,218.666667
996,male,91,group C,high school,free/reduced,none,62,55,55,71,91,66,135.333333
997,female,68,group C,high school,free/reduced,completed,59,71,65,86,68,72,151.666667
998,female,65,group D,some college,standard,completed,68,78,77,17,65,97,171.666667
999,female,32,group D,some college,free/reduced,none,77,86,86,22,32,68,191.666667

In [253]:
df_exams.rename(index={0:'A',1:'B',2:'C'},inplace = True)

In [254]:
df_exams.head(3)

,Gender,test,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score,score1,score2,Average
A,female,16,group B,bachelor's degree,standard,none,72,72,74,49,16,77,168.666667
B,female,29,group C,some college,standard,completed,69,90,88,18,29,73,188.333333
C,female,71,group B,master's degree,standard,none,90,95,93,22,71,20,216.000000